#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + attributes = {}
        id         = "9011630a-696c-450e-af60-3ce6bf663cdb"
        name       = "view-client-tap"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-APPLICATION-SERVICE-ACCOUNT.keycloak_openid_audience_protocol_mapper.Prime-Audience-Mapper will be created
  + resource "keycloak_openid_audience_protocol_mapper" "Prime-Audience-Mapper" {
      + add_to_access_token      = true
      + add_to_id_token          = false
      + client_id                = (known after apply)
      + id                       = (known after apply)
      + included_custom_audience = "prime-web-api"
      + name                     = "Prime Audience Mapper"
      + realm_id                 = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-APPLICATION-SERVICE-ACCOUNT.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "PRIME-APPLICATION-SERVICE-ACCOUNT"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-DOCUMENT-MANAGER.keycloak_openid_audience_protocol_mapper.Prime-Audience-Mapper will be created
  + resource "keycloak_openid_audience_protocol_mapper" "Prime-Audience-Mapper" {
      + add_to_access_token      = true
      + add_to_id_token          = false
      + client_id                = (known after apply)
      + id                       = (known after apply)
      + included_custom_audience = "prime-document-manager"
      + name                     = "Prime Audience Mapper"
      + realm_id                 = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-DOCUMENT-MANAGER.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "PRIME-DOCUMENT-MANAGER"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*